# Data Manipulation: Removing Column and Rows

In [1]:
import pandas as pd
pd.__version__

'1.0.3'

---

## Remove Column
- Using locally saved *ufo.csv* file

In [2]:
ufo = pd.read_csv('Data/ufo.csv')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

#### Removing Columns, method 1:
- using *axis=1* to indicate columns

In [3]:
# Use drop method with axis=1 to drop a column
# Use inplace=True, to drop a column in current dataframe
ufo.drop(labels='Colors Reported', axis=1).head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

#### Remove multiple Columns
- Use a list of columns to remove as an argument

In [4]:
columns_drop = ['City', 'State']
ufo.drop(labels=columns_drop, axis=1).head()

  Colors Reported Shape Reported             Time
0             NaN       TRIANGLE   6/1/1930 22:00
1             NaN          OTHER  6/30/1930 20:00
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00

#### Removing Columns, mehtod 2:
- Use *axis=columns* to indicate columns

In [5]:
# Use axis='columns'
ufo.drop(labels='Colors Reported', axis='columns').head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

#### Removing Columns, method 3:
- Use the *columns* parameter to indicate which columns to remove

In [6]:
# Use columns parameter with a list of columns to remove
ufo.drop(columns=['City', 'State']).head()

  Colors Reported Shape Reported             Time
0             NaN       TRIANGLE   6/1/1930 22:00
1             NaN          OTHER  6/30/1930 20:00
2             NaN           OVAL  2/15/1931 14:00
3             NaN           DISK   6/1/1931 13:00
4             NaN          LIGHT  4/18/1933 19:00

---

## Remove Rows
- Using locally saved *ufo.csv* file

In [7]:
ufo = pd.read_csv('Data/ufo.csv')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

#### Removing Rows, method 1:
- Use *axis=0* to indicate rows

In [8]:
# Remove first 2 rows
# Use rownames to indicate which rows to remove with axis = 0
ufo.drop(labels=[0,1], axis=0).head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

#### Removing Rows, method 2:
- Use *axis='index'* to indicate rows

In [9]:
# Remove next 2 rows
# Use rownames to indicate which rows to remove with axis = 'index'
ufo.drop(labels=[0,1], axis='index').head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

#### Removing Rows, method 3:
- Use the *index* parameter to indicate which rows to remove

In [10]:
# Remove next 2 rows
# Use index parameter with a list of rownames to remove
ufo.drop(index=[0,1]).head()

                   City Colors Reported Shape Reported State             Time
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

---